Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Constructor (String)
 Creates a new curved dimension set base attributes instance that loads the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetBaseAttributes(
	string AttributesFile
)
Public Sub New (
	AttributesFile As String
)
Parameters
AttributesFile
Type: System.String
The attributes file's filename.
See Also
Reference
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Class
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Overload
Tekla.Structures.Drawing Namespace